content.org
#+TITLE: CS 421 Web Content
#+HUGO_BASE_DIR: .
#+HUGO_SECTION: lectures

** Variables and Parameters
:PROPERTIES:
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :type book
:EXPORT_FILE_NAME: variables
:END:

You think you know what a variable is, don't you?  They can be very complicated, actually.  Variables have many
different attributes.  These attributes can become *bound* to the variable at different times.  We will talk about
binding times, and the four properties that variables must have.

*** Videos
- [[/videos/variables][Variables]]
- [[/videos/parameters][Parameters]]
- [[https://mediaspace.illinois.edu/media/t/1_zopjq4ne][Class Session (Spring 2022)]]

