content/lectures/variables.md
+++
title = "Variables and Parameters"
author = ["Mattox Beckman"]
draft = false
type = "book"
+++

You think you know what a variable is, don't you?  They can be very complicated, actually.  Variables have many
different attributes.  These attributes can become **bound** to the variable at different times.  We will talk about
binding times, and the four properties that variables must have.


## Videos {#videos}

-   [Variables](/videos/variables)
-   [Parameters](/videos/parameters)
-   [Class Session (Spring 2022)](https://mediaspace.illinois.edu/media/t/1_zopjq4ne)
